rsa-randria/UCBRx1-LoRaWAN-Measurements/firmware/stm32wl55/LoRaWAN_End_Node/LoRaWAN/App/lora_app.c
			if (params->RxSlot == RX_SLOT_WIN_1)
			{
			  APP_LOG(TS_OFF, VLEVEL_M, "ACK reçu sur Rx1\r\n");
			  channelRewardsRx1[currentChannel]++;
			  channelRewards[currentChannel] += 1.0f;
			}
			else if (params->RxSlot == RX_SLOT_WIN_2)
			{
			  APP_LOG(TS_OFF, VLEVEL_M, "ACK reçu sur Rx2\r\n");
			  channelRewardsRx2[currentChannel]++;
			  channelRewards[currentChannel] += 0.7f;
			}
			//channelRewards[currentChannel]++;
      }

    }
  }

  /* USER CODE END OnRxData_1 */
}


static void SendTxData(void)
{
    /* Tableau des longueurs de payload  & TX souhaitées */
    static const uint8_t payload_lengths[] = {10, 20, 30, 40, 50};
    static const uint8_t txPowers[] = {TX_POWER_0, TX_POWER_1, TX_POWER_2, TX_POWER_3, TX_POWER_4};

    /* Variables statiques pour la gestion */
    static uint8_t currentPayloadIndex = 0;
    static uint8_t sendCounter = 0;
    static uint8_t currentTxIndex = 0;

    uint8_t payloadLength = payload_lengths[currentPayloadIndex];

    LmHandlerErrorStatus_t status = LORAMAC_HANDLER_ERROR;
    UTIL_TIMER_Time_t nextTxIn = 0;

    if (LmHandlerIsBusy() == false)
    {
        AppData.Port = LORAWAN_USER_APP_PORT;

        /* Remplir le buffer avec 0xAA pour payloadLength octets */
        for (uint8_t i = 0; i < payloadLength; i++)
        {
            AppData.Buffer[i] = 0xAA;
        }
        AppData.BufferSize = payloadLength;

        /* Logger la taille du payload et la puissance TX pour le debug */
        APP_LOG(TS_ON, VLEVEL_M, "Payload Length: %d bytes\r\n", payloadLength);
        APP_LOG(TS_ON, VLEVEL_M, "TX Power: %d\r\n", txPowers[currentTxIndex]);


    	if(avecUCB){
    		ucbChannelValue = UCB_SelectChannel(timeStep);
    		LoRaMac_ucbChannel(avecUCB, ucbChannelValue);
    	}

        LmHandlerSetTxPower(txPowers[currentTxIndex]);
        LmHandlerSetTxDatarate(DR_5);

        status = LmHandlerSend(&AppData, LmHandlerParams.IsTxConfirmed, false);
        if (LORAMAC_HANDLER_SUCCESS == status)
        {
            APP_LOG(TS_ON, VLEVEL_L, "SEND REQUEST\r\n");

            sendCounter++;

            /* Tous les 20 envois, passer à la prochaine longueur de payload */
            if (sendCounter >= 20)
            {
                sendCounter = 0;
                currentPayloadIndex++;  // passer au payload suivant

                /* Si tous payload ont été utilisées, augmenter le niveau TX */
                if (currentPayloadIndex >= (sizeof(payload_lengths) / sizeof(payload_lengths[0])))
                {
                    currentPayloadIndex = 0;
                    if (currentTxIndex < (sizeof(txPowers) / sizeof(txPowers[0])) - 1)
                    {
                        currentTxIndex++;  // augmenter la puissance TX
                    }
                    else
                    {
                        currentTxIndex = 0; 	// optionnel
                        avecUCB=~sansUCB;		// with UCB
                    }
                }
            }
        }
        else if (LORAMAC_HANDLER_DUTYCYCLE_RESTRICTED == status)
        {
            nextTxIn = LmHandlerGetDutyCycleWaitTime();
            if (nextTxIn > 0)
            {
                APP_LOG(TS_ON, VLEVEL_L, "Next Tx in  : ~%d second(s)\r\n", (nextTxIn / 1000));
            }
        }
    }

    if (EventType == TX_ON_TIMER)
    {
        UTIL_TIMER_Stop(&TxTimer);
        UTIL_TIMER_SetPeriod(&TxTimer, MAX(nextTxIn, TxPeriodicity));
        UTIL_TIMER_Start(&TxTimer);
    }
}




static void OnTxTimerEvent(void *context)
{
  /* USER CODE BEGIN OnTxTimerEvent_1 */

  /* USER CODE END OnTxTimerEvent_1 */
  UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), CFG_SEQ_Prio_0);

  /*Wait for next tx slot*/
  UTIL_TIMER_Start(&TxTimer);
  /* USER CODE BEGIN OnTxTimerEvent_2 */

  /* USER CODE END OnTxTimerEvent_2 */
}

/* USER CODE BEGIN PrFD_LedEvents */
static void OnTxTimerLedEvent(void *context)
{
  HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET); /* LED_GREEN */
}

static void OnRxTimerLedEvent(void *context)
{
  HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_RESET); /* LED_BLUE */
}

static void OnJoinTimerLedEvent(void *context)
{
  HAL_GPIO_TogglePin(LED3_GPIO_Port, LED3_Pin); /* LED_RED */
}

/* USER CODE END PrFD_LedEvents */

static void OnTxData(LmHandlerTxParams_t *params)
{
  /* USER CODE BEGIN OnTxData_1 */

  if ((params != NULL))
  {
    /* Process Tx event only if its a mcps response to prevent some internal events (mlme) */
    if (params->IsMcpsConfirm != 0)
    {

      APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### ========== MCPS-Confirm =============\r\n");
      APP_LOG(TS_OFF, VLEVEL_H, "###### U/L FRAME:%04d | PORT:%d | DR:%d | PWR:%d", params->UplinkCounter, params->AppData.Port, params->Datarate, params->TxPower);
      }

      APP_LOG(TS_OFF, VLEVEL_H, " | MSG TYPE:");
      if (params->MsgType == LORAMAC_HANDLER_CONFIRMED_MSG)
      {
        APP_LOG(TS_OFF, VLEVEL_H, "CONFIRMED [%s]\r\n", (params->AckReceived != 0) ? "ACK" : "NACK");

      }
      else
      {
        APP_LOG(TS_OFF, VLEVEL_H, "UNCONFIRMED\r\n");
      }

      payload=params->AppData.BufferSize;
      txpower=params->TxPower;

      if(avecUCB){
    	  timeStep=	params->UplinkCounter;
    	  currentChannel = params->Channel;
    	  channelCount[currentChannel]++;
      }

  }
  /* USER CODE END OnTxData_1 */
}

static void OnJoinRequest(LmHandlerJoinParams_t *joinParams)
{
  /* USER CODE BEGIN OnJoinRequest_1 */
  if (joinParams != NULL)
  {
    if (joinParams->Status == LORAMAC_HANDLER_SUCCESS)
    {
      UTIL_TIMER_Stop(&JoinLedTimer);
      HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_RESET); /* LED_RED */

      APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### = JOINED = ");
      if (joinParams->Mode == ACTIVATION_TYPE_ABP)
      {
        APP_LOG(TS_OFF, VLEVEL_M, "ABP ======================\r\n");
      }
      else
      {
        APP_LOG(TS_OFF, VLEVEL_M, "OTAA =====================\r\n");
        avecUCB=!sansUCB;
      }
    }
    else
    {
      APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### = JOIN FAILED\r\n");
    }

